IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
AUTHOR. HAPPY.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC A(20).

PROCEDURE DIVISION.
1000-START-PARA.
    DISPLAY "Enter your surname: " WITH NO ADVANCING.
    ACCEPT WS-NAME.
    DISPLAY "EU sunt un boss " WS-NAME.
    STOP RUN.
